# HW 0 - Intro to Pandas
Credit: https://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html

In [1]:
import numpy as np
import pandas as pd
import matplotlib as plt

## Object Creation

Creating a Series by passing a list of values, letting pandas create a default integer index:

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Creating a DataFrame by passing a NumPy array, with a datetime index and labeled columns:

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.923483 -0.719439 -0.511611 -0.084517
2013-01-02  0.849778 -0.251500 -1.854009 -1.931501
2013-01-03 -0.433187  0.865709 -1.153828  0.199086
2013-01-04  0.599276  0.172997  0.499631  0.702376
2013-01-05 -0.605707  2.032736 -0.636630 -0.293410
2013-01-06 -0.337835 -0.665872  0.812956  0.551134

Creating a DataFrame by passing a dict of objects that can be converted to series-like.

In [5]:
df2 = pd.DataFrame({'A': 1.,
                     'B': pd.Timestamp('20130102'),
                     'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                     'D': np.array([3] * 4, dtype='int32'),
                     'E': pd.Categorical(["test", "train", "test", "train"]),
                     'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

The columns of the resulting DataFrame have different dtypes.

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## Viewing Data

View the top and bottom rows of the frame:

In [7]:
df.head()

                   A         B         C         D
2013-01-01 -1.923483 -0.719439 -0.511611 -0.084517
2013-01-02  0.849778 -0.251500 -1.854009 -1.931501
2013-01-03 -0.433187  0.865709 -1.153828  0.199086
2013-01-04  0.599276  0.172997  0.499631  0.702376
2013-01-05 -0.605707  2.032736 -0.636630 -0.293410

In [8]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.599276  0.172997  0.499631  0.702376
2013-01-05 -0.605707  2.032736 -0.636630 -0.293410
2013-01-06 -0.337835 -0.665872  0.812956  0.551134

Display the index, columns:

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

DataFrame.to_numpy() gives a NumPy representation of the underlying data. Note that this can be an expensive operation when your DataFrame has columns with different data types, which comes down to a fundamental difference between pandas and NumPy: NumPy arrays have one dtype for the entire array, while pandas DataFrames have one dtype per column. When you call DataFrame.to_numpy(), pandas will find the NumPy dtype that can hold all of the dtypes in the DataFrame. This may end up being object, which requires casting every value to a Python object.

For df, our DataFrame of all floating-point values, DataFrame.to_numpy() is fast and doesnâ€™t require copying data.

In [11]:
df.values

array([[-1.92348278, -0.71943869, -0.51161115, -0.08451734],
       [ 0.84977752, -0.25149981, -1.85400899, -1.931501  ],
       [-0.43318729,  0.86570924, -1.15382836,  0.19908616],
       [ 0.59927556,  0.17299733,  0.49963075,  0.70237633],
       [-0.6057067 ,  2.03273579, -0.63662993, -0.29341012],
       [-0.3378354 , -0.66587186,  0.81295643,  0.55113416]])

In [12]:
df2.values

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

.describe( ) shows a quick statistic summary of your data:

In [13]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.308527  0.239105 -0.473915 -0.142805
std    0.987783  1.057601  0.999867  0.952710
min   -1.923483 -0.719439 -1.854009 -1.931501
25%   -0.562577 -0.562279 -1.024529 -0.241187
50%   -0.385511 -0.039251 -0.574121  0.057284
75%    0.364998  0.692531  0.246820  0.463122
max    0.849778  2.032736  0.812956  0.702376

Transposing your data:

In [14]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.923483    0.849778   -0.433187    0.599276   -0.605707   -0.337835
B   -0.719439   -0.251500    0.865709    0.172997    2.032736   -0.665872
C   -0.511611   -1.854009   -1.153828    0.499631   -0.636630    0.812956
D   -0.084517   -1.931501    0.199086    0.702376   -0.293410    0.551134

Sorting by an axis:

In [15]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.084517 -0.511611 -0.719439 -1.923483
2013-01-02 -1.931501 -1.854009 -0.251500  0.849778
2013-01-03  0.199086 -1.153828  0.865709 -0.433187
2013-01-04  0.702376  0.499631  0.172997  0.599276
2013-01-05 -0.293410 -0.636630  2.032736 -0.605707
2013-01-06  0.551134  0.812956 -0.665872 -0.337835

Sorting by values:

In [16]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-01 -1.923483 -0.719439 -0.511611 -0.084517
2013-01-06 -0.337835 -0.665872  0.812956  0.551134
2013-01-02  0.849778 -0.251500 -1.854009 -1.931501
2013-01-04  0.599276  0.172997  0.499631  0.702376
2013-01-03 -0.433187  0.865709 -1.153828  0.199086
2013-01-05 -0.605707  2.032736 -0.636630 -0.293410

## Selection

### Getting

Selecting a single column, which yields a Series, equivalent to df.A:

In [17]:
df['A']

2013-01-01   -1.923483
2013-01-02    0.849778
2013-01-03   -0.433187
2013-01-04    0.599276
2013-01-05   -0.605707
2013-01-06   -0.337835
Freq: D, Name: A, dtype: float64

Selecting via [ ], which slices the rows.

In [18]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.923483 -0.719439 -0.511611 -0.084517
2013-01-02  0.849778 -0.251500 -1.854009 -1.931501
2013-01-03 -0.433187  0.865709 -1.153828  0.199086

In [19]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.849778 -0.251500 -1.854009 -1.931501
2013-01-03 -0.433187  0.865709 -1.153828  0.199086
2013-01-04  0.599276  0.172997  0.499631  0.702376

### Selection by label

For getting a cross section using a label:

In [20]:
df.loc[dates[0]]

A   -1.923483
B   -0.719439
C   -0.511611
D   -0.084517
Name: 2013-01-01 00:00:00, dtype: float64

Selecting on a multi-axis by label:

In [21]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01 -1.923483 -0.719439
2013-01-02  0.849778 -0.251500
2013-01-03 -0.433187  0.865709
2013-01-04  0.599276  0.172997
2013-01-05 -0.605707  2.032736
2013-01-06 -0.337835 -0.665872

Showing label slicing, both endpoints are included:

In [22]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  0.849778 -0.251500
2013-01-03 -0.433187  0.865709
2013-01-04  0.599276  0.172997

Reduction in the dimensions of the returned object:

In [23]:
df.loc['20130102', ['A', 'B']]

A    0.849778
B   -0.251500
Name: 2013-01-02 00:00:00, dtype: float64

For getting a scalar value:

In [24]:
df.loc[dates[0], 'A']

-1.9234827769142684

For getting fast access to a scalar (equivalent to the prior method):

In [25]:
df.at[dates[0], 'A']

-1.9234827769142684

### Selection by position

Select via the position of the passed integers:

In [26]:
df.iloc[3]

A    0.599276
B    0.172997
C    0.499631
D    0.702376
Name: 2013-01-04 00:00:00, dtype: float64

By integer slices, acting similar to numpy/python:

In [27]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.599276  0.172997
2013-01-05 -0.605707  2.032736

By lists of integer position locations, similar to the numpy/python style:

In [28]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.849778 -1.854009
2013-01-03 -0.433187 -1.153828
2013-01-05 -0.605707 -0.636630

For slicing rows explicitly:

In [29]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.849778 -0.251500 -1.854009 -1.931501
2013-01-03 -0.433187  0.865709 -1.153828  0.199086

For slicing columns explicitly:

In [30]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.719439 -0.511611
2013-01-02 -0.251500 -1.854009
2013-01-03  0.865709 -1.153828
2013-01-04  0.172997  0.499631
2013-01-05  2.032736 -0.636630
2013-01-06 -0.665872  0.812956

For getting a value explicitly:

In [31]:
df.iloc[1, 1]

-0.2514998111349862

For getting fast access to a scalar (equivalent to the prior method):

In [32]:
df.iat[1, 1]

-0.2514998111349862

### Boolean Indexing

Selecting values from a DataFrame where a boolean condition is met.

In [33]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02  0.849778       NaN       NaN       NaN
2013-01-03       NaN  0.865709       NaN  0.199086
2013-01-04  0.599276  0.172997  0.499631  0.702376
2013-01-05       NaN  2.032736       NaN       NaN
2013-01-06       NaN       NaN  0.812956  0.551134

Using the isin() method for filtering:

In [34]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01 -1.923483 -0.719439 -0.511611 -0.084517    one
2013-01-02  0.849778 -0.251500 -1.854009 -1.931501    one
2013-01-03 -0.433187  0.865709 -1.153828  0.199086    two
2013-01-04  0.599276  0.172997  0.499631  0.702376  three
2013-01-05 -0.605707  2.032736 -0.636630 -0.293410   four
2013-01-06 -0.337835 -0.665872  0.812956  0.551134  three

In [35]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -0.433187  0.865709 -1.153828  0.199086   two
2013-01-05 -0.605707  2.032736 -0.636630 -0.293410  four

### Setting

Setting a new column automatically aligns the data by the indexes.

In [36]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [37]:
df['F'] = s1

Setting values by label:

In [38]:
df.at[dates[0], 'A'] = 0

Setting values by position:

In [39]:
df.iat[0, 1] = 0

Setting by assigning with a NumPy array:

In [40]:
df.loc[:, 'D'] = np.array([5] * len(df))

The result of the prior setting operations.

In [41]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.511611  5  NaN
2013-01-02  0.849778 -0.251500 -1.854009  5  1.0
2013-01-03 -0.433187  0.865709 -1.153828  5  2.0
2013-01-04  0.599276  0.172997  0.499631  5  3.0
2013-01-05 -0.605707  2.032736 -0.636630  5  4.0
2013-01-06 -0.337835 -0.665872  0.812956  5  5.0

A where operation with setting.

In [42]:
df2 = df.copy()

df2[df2 > 0] = -df2

df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.511611 -5  NaN
2013-01-02 -0.849778 -0.251500 -1.854009 -5 -1.0
2013-01-03 -0.433187 -0.865709 -1.153828 -5 -2.0
2013-01-04 -0.599276 -0.172997 -0.499631 -5 -3.0
2013-01-05 -0.605707 -2.032736 -0.636630 -5 -4.0
2013-01-06 -0.337835 -0.665872 -0.812956 -5 -5.0

### Missing Data

pandas primarily uses the value np.nan to represent missing data. It is by default not included in computations. See the Missing Data section.

Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.

In [43]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

df1.loc[dates[0]:dates[1], 'E'] = 1

df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.511611  5  NaN  1.0
2013-01-02  0.849778 -0.251500 -1.854009  5  1.0  1.0
2013-01-03 -0.433187  0.865709 -1.153828  5  2.0  NaN
2013-01-04  0.599276  0.172997  0.499631  5  3.0  NaN

** To drop any rows that have missing data. **

In [44]:
df1.dropna()

                   A       B         C  D    F    E
2013-01-02  0.849778 -0.2515 -1.854009  5  1.0  1.0

Filling missing data.

In [45]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.511611  5  5.0  1.0
2013-01-02  0.849778 -0.251500 -1.854009  5  1.0  1.0
2013-01-03 -0.433187  0.865709 -1.153828  5  2.0  5.0
2013-01-04  0.599276  0.172997  0.499631  5  3.0  5.0

To get the boolean mask where values are nan

In [46]:
df1.isnull()

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

## Operations

### Stats

Performing a descriptive statistic:

In [47]:
df.mean()

A    0.012054
B    0.359012
C   -0.473915
D    5.000000
F    3.000000
dtype: float64

Same operation on the other axis:

In [48]:
df.mean(1)

2013-01-01    1.122097
2013-01-02    0.948854
2013-01-03    1.255739
2013-01-04    1.854381
2013-01-05    1.958080
2013-01-06    1.961850
Freq: D, dtype: float64

Operating with objects that have different dimensionality and need alignment. In addition, pandas automatically broadcasts along the specified dimension.

In [49]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [50]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -1.433187 -0.134291 -2.153828  4.0  1.0
2013-01-04 -2.400724 -2.827003 -2.500369  2.0  0.0
2013-01-05 -5.605707 -2.967264 -5.636630  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

### Apply

Applying functions to the data:

In [51]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -0.511611   5   NaN
2013-01-02  0.849778 -0.251500 -2.365620  10   1.0
2013-01-03  0.416590  0.614209 -3.519449  15   3.0
2013-01-04  1.015866  0.787207 -3.019818  20   6.0
2013-01-05  0.410159  2.819943 -3.656448  25  10.0
2013-01-06  0.072324  2.154071 -2.843491  30  15.0

### Histrogramming

In [52]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    3
1    5
2    2
3    4
4    4
5    6
6    3
7    4
8    4
9    6
dtype: int64

In [53]:
s.value_counts()

4    4
6    2
3    2
5    1
2    1
dtype: int64

### String Method

Series is equipped with a set of string processing methods in the str attribute that make it easy to operate on each element of the array, as in the code snippet below. Note that pattern-matching in str generally uses regular expressions by default (and in some cases always uses them).

In [54]:
s = pd.Series(['A', 'B', 'C', 'AaBa', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s

0       A
1       B
2       C
3    AaBa
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [55]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

## Merge

### Concat

pandas provides various facilities for easily combining together Series and DataFrame objects with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations.

Concatenating pandas objects together with concat():

In [56]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  2.824894  0.771180  0.628515 -0.387166
1  2.356713  0.859784 -0.155647  0.242401
2 -0.287913  0.545956 -0.378947  1.229514
3 -0.239899 -0.072063 -2.284179  0.433781
4  1.211026 -0.121524  0.189350 -0.292253
5 -0.385084  0.461996  1.410205  0.599834
6 -0.579174 -1.192324 -0.113016 -0.548035
7 -0.123766 -0.124946  2.089081  0.041973
8  0.735962  0.270552  0.080766  1.576856
9  1.136195  0.382993  0.186274  1.000118

In [57]:
# Break it into pieces
pieces = [df[0:3], df[7:]]
pd.concat(pieces)

          0         1         2         3
0  2.824894  0.771180  0.628515 -0.387166
1  2.356713  0.859784 -0.155647  0.242401
2 -0.287913  0.545956 -0.378947  1.229514
7 -0.123766 -0.124946  2.089081  0.041973
8  0.735962  0.270552  0.080766  1.576856
9  1.136195  0.382993  0.186274  1.000118

### Join

SQL style merges

In [58]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

Another Example:

In [59]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

### Append

Append rows to a dataframe.

In [60]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D'])
df

          A         B         C         D
0 -0.163314  1.079529 -0.633892  0.058808
1  0.277443  0.626429 -1.010800  0.082942
2 -1.517171 -0.164687  1.138279 -0.520300
3 -0.060101  0.720243  0.913851  0.002197
4  2.293812  1.195750  1.008460  0.333924
5 -0.241101  0.914483  0.014965 -0.630126
6  0.315216  0.715820  1.048723 -1.266649
7 -1.514112  0.603905  0.008666 -1.078043

In [61]:
s = df.iloc[3]
df.append(s, ignore_index=True)

          A         B         C         D
0 -0.163314  1.079529 -0.633892  0.058808
1  0.277443  0.626429 -1.010800  0.082942
2 -1.517171 -0.164687  1.138279 -0.520300
3 -0.060101  0.720243  0.913851  0.002197
4  2.293812  1.195750  1.008460  0.333924
5 -0.241101  0.914483  0.014965 -0.630126
6  0.315216  0.715820  1.048723 -1.266649
7 -1.514112  0.603905  0.008666 -1.078043
8 -0.060101  0.720243  0.913851  0.002197

## Grouping

By â€œgroup byâ€ we are referring to a process involving one or more of the following steps:

* Splitting the data into groups based on some criteria
* Applying a function to each group independently
* Combining the results into a data structure

In [62]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                    'B': ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                    'C': np.random.randn(8),
                    'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one -0.705510  0.902688
1  bar    one -0.350034 -0.356982
2  foo    two  0.892692 -0.364182
3  bar  three  0.517453  0.322708
4  foo    two  0.651788  1.247099
5  bar    two -0.107070  0.441013
6  foo    one -0.156926 -2.028757
7  foo  three  0.754266  1.334115

Grouping and then applying the sum() function to the resulting groups.

In [63]:
df.groupby('A').sum()

            C         D
A
bar  0.060350  0.406739
foo  1.436311  1.090965

Grouping by multiple columns forms a hierarchical index, and again we can apply the sum function.

In [64]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one   -0.350034 -0.356982
    three  0.517453  0.322708
    two   -0.107070  0.441013
foo one   -0.862436 -1.126068
    three  0.754266  1.334115
    two    1.544481  0.882918

## Plotting

In [65]:
ts = pd.Series(np.random.randn(1000),
                index=pd.date_range('1/1/2000', periods=1000))
ts = ts.cumsum()
ts.plot()

In [66]:
df = pd.DataFrame(np.random.randn(1000, 4), index=ts.index,
                   columns=['A', 'B', 'C', 'D'])
df = df.cumsum()

df.plot()

## Getting data in/out

### CSV

In [67]:
df.to_csv('foo.csv')

In [68]:
pd.read_csv('foo.csv').head()

   Unnamed: 0         A         B         C         D
0  2000-01-01 -0.409217  0.663034  0.656159  0.970976
1  2000-01-02 -2.185598  0.659010  1.252306  1.471115
2  2000-01-03 -2.429908 -0.326262 -1.147582  3.243034
3  2000-01-04 -1.596206  0.357834 -1.263844  3.214060
4  2000-01-05 -2.837676  0.752405 -1.420281  2.983815